ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.h
/*! @name PIO0_3 (number 85), LD1DATA
  @{ */
#define BOARD_INITPINS_LD1DATA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1DATA_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1DATA_PIN 3U    /*!<@brief 0U pin index: 3 */
                                         /* @} */

/*! @name PIO0_5 (number 89), LD2BLANK
  @{ */
#define BOARD_INITPINS_LD2BLANK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2BLANK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD2BLANK_PIN 5U    /*!<@brief 0U pin index: 5 */
                                          /* @} */

/*! @name PIO0_6 (number 90), LD1CLK
  @{ */
#define BOARD_INITPINS_LD1CLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1CLK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1CLK_PIN 6U    /*!<@brief 0U pin index: 6 */
                                        /* @} */

/*! @name PIO0_19 (number 91), SW1LATCH
  @{ */
#define BOARD_INITPINS_SW1LATCH_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW1LATCH_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_SW1LATCH_PIN 19U   /*!<@brief 0U pin index: 19 */
                                          /* @} */

/*! @name PIO1_31 (number 92), LD2XLAT
  @{ */
#define BOARD_INITPINS_LD2XLAT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2XLAT_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LD2XLAT_PIN 31U   /*!<@brief 1U pin index: 31 */
                                         /* @} */

/*! @name PIO1_11 (number 94), SW2LATCH
  @{ */
#define BOARD_INITPINS_SW2LATCH_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW2LATCH_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SW2LATCH_PIN 11U   /*!<@brief 1U pin index: 11 */
                                          /* @} */

/*! @name PIO0_1 (number 100), LD1BLANK
  @{ */
#define BOARD_INITPINS_LD1BLANK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1BLANK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1BLANK_PIN 1U    /*!<@brief 0U pin index: 1 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
